using Tyuiu.ShakhovDK.Sprint4.Task6.V12.Lib;
DataService ds = new DataService();
Console.Title = "Спринт #4 | Выполнил: Шахов Д.К | ИИПБ-24-2";
Console.WriteLine("******************************************************************************************");
Console.WriteLine("* Спринт #4                                                                              *");
Console.WriteLine("* Тема: Класс Array                                                                      *");
Console.WriteLine("* Задание #6                                                                             *");
Console.WriteLine("* Вариант #12                                                                            *");
Console.WriteLine("* Выполнил: Шахов Даниил Константинович | ИИПБ-24-2                                      *");
Console.WriteLine("******************************************************************************************");
Console.WriteLine("* УСЛОВИЕ:                                                                               *");
Console.WriteLine("Дан строковый массив данных, используя класс Array, выведите элементы массива,\n" +
    "Длина которых равна 7 символам.");
Console.WriteLine("******************************************************************************************");
Console.WriteLine("* ИСХОДНЫЕ ДАННЫЕ:                                                                       *");
Console.WriteLine("******************************************************************************************");
Console.WriteLine("* [Россия, Украина, Беларусь, Казахстан, Молдова, Латвия, Эстония]                       *");
string[] countries = { "Россия", "Украина", "Беларусь", "Казахстан", "Молдова", "Латвия", "Эстония" };
string[] res = ds.Calculate(countries);
Console.WriteLine("******************************************************************************************");
Console.WriteLine("* РЕЗУЛЬТАТ:                                                                             *");
foreach (string s in res)
{
    Console.Write($"{s},  ");
}
Console.WriteLine();
Console.WriteLine("******************************************************************************************");
Console.ReadKey();