using Tyuiu.ShakhovDK.Sprint4.Task0.V21.Lib;
DataService ds = new DataService();
int[] numsArray = { 8, 2, 4, 3, 8, 5, 6, 7, 9, 8 };
int res = ds.GetSumEvenArrEl(numsArray);
Console.Title = "Спринт #4 | Выполнил: Шахов Д.К | ИИПБ-24-2";
Console.WriteLine("******************************************************************************************");
Console.WriteLine("* Спринт #4                                                                              *");
Console.WriteLine("* Тема: Одномерные массивы (статический ввод)                                            *");
Console.WriteLine("* Задание #0                                                                             *");
Console.WriteLine("* Вариант #21                                                                            *");
Console.WriteLine("* Выполнил: Шахов Даниил Константинович | ИИПБ-24-2                                      *");
Console.WriteLine("******************************************************************************************");
Console.WriteLine("* УСЛОВИЕ:                                                                               *");
Console.WriteLine("Дан одномерный целочисленный массив на 10 элементов,\n" +
"заполненный статическими значениями в диапазоне от 0 до 9\n" +
"подсчитать сумму четных элементов массива\n" +
"{8, 2, 4, 3, 8, 5, 6, 7, 9, 8}.");
Console.WriteLine("******************************************************************************************");
Console.WriteLine("* ИСХОДНЫЕ ДАННЫЕ:                                                                       *");
Console.WriteLine("******************************************************************************************");
Console.WriteLine("{8, 2, 4, 3, 8, 5, 6, 7, 9, 8}");
Console.WriteLine("******************************************************************************************");
Console.WriteLine("* РЕЗУЛЬТАТ:                                                                             *");
Console.WriteLine($"Сумма чётных элементов равна {res}                                                       ");
Console.WriteLine("******************************************************************************************");
Console.ReadKey();